# ================================== Start
"""

入力例1
-10

出力例1
-9

入力例2
0

出力例2
1

"""


num_01 = int(input())


def B_challenge_01(num_01):
    print(num_01 + 1)


# === 実行
B_challenge_01(num_01)

# ================================== End

# ================================== Start

"""
改行区切りで自然数が n 個入力されるので、n 個の自然数をそのまま出力

入力例1
1
54

出力例1
54

入力例2
4
382
695
928
577

出力例2
382
695
928
577

"""

num_02 = int(input())


def B_challenge_02(num_02):
    arr_02 = []

    for i in range(num_02):
        tmp = int(input())
        arr_02.append(tmp)

    for j in arr_02:
        print(str(j))


# === 実行
B_challenge_02(num_02)

# ================================== End

# ================================== Start

""" 
1, 3, 5, 6, 3, 2, 5, 23, 2 を出力
（リストとして）

"""

arr_03 = {1, 3, 5, 6, 3, 2, 5, 23, 2}
ans_03 = 0
for i in arr_03:
    ans_03 = ans_03 + i

# =================================== End

# ================================== Start

"""
単純な出力
"""
arr_03 = [1, 3, 5, 6, 3, 2, 5, 23, 2]

ans_03 = 0
for i in arr_03:
    ans_03 += i

print(str(ans_03))

# =================================== End

# =================================== Start

"""
入力例1
5

出力例1
high

入力例2
6

出力例2
high

入力例3
4

出力例3
low
"""
num_03 = int(input())


def B_challenge_04(num_03):
    if num_03 <= 4:
        print('low')
    else:
        print('high')


# === 実行
B_challenge_04(num_03)

# =================================== End

# =================================== Start

"""
指定した配列（リスト）を定義し、それらの要素のうち5以上の数をすべて足し合わせた値を出力

4, 0, 5, -1, 3, 10, 6, -8

"""

arr_04 = [4, 0, 5, -1, 3, 10, 6, -8]
ans_04 = 0
for i in arr_04:
    if i >= 5:
        ans_04 += i

print(str(ans_04))

# =================================== End

# =================================== Start

"""

n個の整数のうち、5以上のものをすべて足し合わせた値を出力

入力例1
1
3

出力例1
0

入力例2
5
1
-5
1
4
3

出力例2
0

入力例3
9
2
-3
-3
4
-1
6
4
5
8

出力例3
19

"""

num_05 = int(input())
arr_05 = []

for i in range(num_05):
    tmp = int(input())
    arr_05.append(tmp)

ans_05 = 0

for val in arr_05:
    if val >= 5:
        ans_05 += val
    else:
        continue

print(ans_05)

# =================================== End


