# ================================== Start

"""
01

"""


num_01 = int(input())
print(num_01 + 1)

# ================================== End

# ================================== Start
"""
整数 n が1行目、続く行で n 個の文字列が与えられるので、n 個の文字列をそのまま出力

入力例1
3
AB
CD
EF

出力例1
AB
CD
EF

入力例2
3
1
2
3

出力例2
1
2
3

"""

num_02 = int(input())
arr_03 = []

idx_02 = 0
while num_02 > idx_02:
    tmp = input()
    print(tmp)
    idx_02 += 1

# ================================== End

# ================================== Start

"""

入力例1
Hello World

出力例1
Hello
World

入力例2
apple orange

出力例2
apple
orange

"""

a_str_04, b_str_04 = map(str, input().split())

print(a_str_04)
print(b_str_04)

# ================================== End

# ================================== Start

"""

スペース区切りの2つの整数が入力されるので、それらを足して出力

力例1
0 0

出力例1
0

入力例2
1 2

出力例2
3

入力例3
10 20

出力例3
30

"""
i_num_05 = input().split()
print(int(i_num_05[0]) + int(i_num_05[1]))

# ================================== End

# ================================== Start

"""

同じ数値だったら、掛ける。
違ったら、足す。

入力例1
5
2 1
3 6
4 2
4 4
4 70

出力例1
108

"""

i_num_06 = int(input())
ans_06 = 0
for i in range(i_num_06):
    arr_06 = input().split()
    # === 同じなら 掛ける
    if arr_06[0] == arr_06[1]:
        ans_06 += int(arr_06[0]) * int(arr_06[1])
    # === 違う整数なら、足す
    else:
        ans_06 += int(arr_06[0]) + int(arr_06[1])

print(ans_06)


# ================================== End

# ================================== Start

"""

"""

# ================================== End
