# ================================== Start

"""
整数 n が入力されるので、その値に1を足した値を出力

入力例1
-10

出力例1
-9

入力例2
0

出力例2
1

"""

i_01 = int(input())


def B_challenge_5_01(i_01):

    print(i_01 + 1)


# === 実行
B_challenge_5_01(i_01)


# ================================== End

# ================================== Start

"""

1行目に行数を表す整数 n、続く n 行で m 個の「文字」と「整数」の組が空白区切りで入力されます。
n 個の整数だけをそのまま順に出力

入力例1
4
S 1
F 2
E 5
Y 6

出力例1
1
2
5
6

"""

i_02 = int(input())


def B_challenge_5_02(i_02):
    for i in range(i_02):
        arr_02 = input().split()
        print(arr_02[1])


# === 実行
B_challenge_5_02(i_02) == = End

# ================================== Start

"""

1行目で整数 n が与えられ、2行目で n 個の整数が与えられます。
n 個の整数を昇順に出力

入力例1
8
90 777 8888 121 333 4 29 2

出力例1
2
4
29
90
121
333
777
8888

"""

# ************************* バブルソート ***********************
# === 配列の要素数　ループ
num_03 = int(input())
arr_03 = list(map(int, input().split()))

# === 配列の要素数　ループ
for i in range(num_03):
    # 逆順　ループ
    for j in range(num_03 - 1, i, -1):
        if arr_03[j] < arr_03[j - 1]:
            arr_03[j], arr_03[j - 1] = arr_03[j - 1], arr_03[j]

# === 出力
for val in arr_03:
    print(val)

# ================================== End

# ================================== Start

"""
n 個の組を、「整数」の値で昇順に並べ変え、「文字列」を1行ずつ出力

入力例1
2
A 1
B 2

出力例1
A
B

入力例2
3
G 0
S 3
E -2

出力例2
E
G
S

"""

# ================================== End


# ================================== Start

"""

"""

# ================================== End

# ================================== Start

"""

"""

# ================================== End


# ================================== Start

"""

"""

# ================================== End

# ================================== Start

"""

"""

# ================================== End

# ================================== Start

"""

"""

# ================================== End

# ================================== Start

"""

"""

# ================================== End
