""" 
累積和

累積和は、一言でいうと「適切な前処理をおこない、配列上の区間の総和を高速で処理できるようにする手法」

a = [1, 5, 9, 7, 5, 3, 2, 5, 8, 4]
s = [0] * 11

for i in range(10):
    s[i + 1] = s[i] + a[i]

print(s[8] - s[2])

"""

"""
# 累積和じゃない コード
tmp = []
arr = [1,5,9,7,5,3,2,5,8,4]
for i in range(2, 8):
    tmp_i = arr[i]
    tmp.append(tmp_i)
    
print(sum(tmp))
"""

"""
累積和 表

-------------------------

0:  s0  0  |  a0  1

1:  s1  1  |  a1  5

2:  s2  6  |  a2  9
 
3:  s3  15 |  a3  7

4:  s4  22 |  a4  5

5:  s5  27 |  a5  3

6:  s6  30 |  a6  2

7:  s7  32 |  a7  5

8:  s8  37 |  a8  8

9:  s9  45 |  a9  4 

10: s10 49 |  

-------------------------

"""

###### ============= 累積和

arr = [1,5,9,7,5,3,2,5,8,4] # 10個要素　
s = [0] * 11 # arr より１つ多い 配列要素を作成する

for i in range(10):
    s[i + 1] = s[i] + arr[i]
    
# 累積和　同士で　演算して解を出す
print(s[8] - s[2]) # s[8] 37 - s[2] 6 = 31 


