
# ================================== Start
"""

3 を 8 回、改行区切りで出力してください。
出力の末尾には改行を入れてください。

3
3
3
3
3
3
3
3
    
"""


def Loop_04(num):
    for i in range(num):
        print('3')


Loop_04(8)

# ================================== End

# ================================== Start

"""

入力例1
3 8

出力例1
3
3
3
3
3
3
3
3

"""

a_02, b_02 = map(int, input().split())


def Loop_05(a_02, b_02):
    for i in range(b_02):
        print(a_02)


# === 実行
Loop_05(a_02, b_02)

# ================================== End

# ================================== Start


# ================================== End
